Ruby/odot/app/controllers/password_resets_controller.rb

  def edit
    @user = User.find_by(password_reset_token: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'Sn1M8nIFFIucRwrwptiGM4m0GieBrZqOs9KMVsh3KGk-LCxNz6paoBtGcemqjdBz' LIMIT 1

  def update
    @user = User.find_by(password_reset_token: params[:id])
    if @user && @user.update_attributes(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'GxtruAvsexWdDN3ZFXpN9T36PP3OCfm_Jwcok_SEQsT2Hb07Nzp2d28XR_f3K_To' LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$MCR9AUVEVd9eZUX2mPTW1ubLu3078rPMf4fWK31LRR8ykkMyxt4Je', `updated_at` = '2014-12-26 07:53:29' WHERE `users`.`id` = 1