Ruby/odot/app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 07 Nov 2014 01:49:27 UTC +00:00], ["description", "bla\r\n"], ["title", "Lista 1"], ["updated_at", Fri, 07 Nov 2014 01:49:27 UTC +00:00]]
---
  def create
    @todo_list = current_user.todo_lists.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE `todo_lists` SET `title` = 'New title', `description` = 'New description', `updated_at` = '2014-12-21 19:00:58' WHERE `todo_lists`.`id` = 1
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

SELECT `todo_lists`.* FROM `todo_lists` WHERE `todo_lists`.`user_id` = 12 AND `todo_lists`.`id` = 39 LIMIT 1
---
    def set_todo_list
      @todo_list = current_user.todo_lists.find(params[:id])