Ruby/odot/app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password_digest`, `updated_at`) VALUES ('2014-12-21 20:06:59', 'luis@mendoza.io', 'Luis', 'Mendoza', '$2a$10$TjWIrP32mS0.PiWh3mA5qe5Ur1oOtmkKMqvZPCecTMw/aIBTOGZ/u', '2014-12-21 20:06:59')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save